cfe llm/DataProcessors/AI_НовоеДействие.xml
<?xml version="1.0" encoding="utf-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>AI_НовоеДействие</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

cfe llm/Enums/AI_ВидДействия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>AI_ВидДействия</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТолькоПоказать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаполнитьФорму</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаписатьОбъект</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПользовательскоеДействие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнийОбработчик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоздатьОбъект</Name>				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cfe llm/Enums/AI_РежимВыполнения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>AI_РежимВыполнения</Name>
			<Comment>Как обрабатывать несколько выбранных объектов: по объекту через очередь либо одним запросом к модели.</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Очередь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОднимЗапросом</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cfe llm/Catalogs/AI_КартыИзвлечения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>AI_КартыИзвлечения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Активна</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеИмяМетаданных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаменятьСтрокиТабличныхЧастей</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Поля</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ключ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЗначения</Name>
							<Type>
								<v8:Type>d5p1:EnumRef.AI_ТипЗначенияПоля</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипСсылки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПутьРеквизита</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоискПоНаименованию</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обязательное</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подсказка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТабличнаяЧасть</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДополнительныйРеквизит</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыбиратьИзСписка</Name>							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<Attribute>
				<Properties>
					<Name>ОбновлятьСтрокиПоНомеру</Name>					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cfe llm/Catalogs/AI_Сценарии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>AI_Сценарии</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Агент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AI_Агенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Провайдер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AI_Провайдеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AI_Модели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипAPI</Name>					<Type>
						<v8:Type>cfg:EnumRef.AI_ТипAPI</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияКонтракта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаОтветаJSON</Name>					<Comment /><Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
					<FillFromFillingValue>false</FillFromFillingValue>				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОбработчика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьПовтор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимумПопыток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДляСтаройОчереди</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРазбораВложений</Name>
					<Type>
						<v8:Type>d5p1:EnumRef.AI_СпособРазбораВложений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cfe llm/DataProcessors/AI_НовоеДействие/Ext/ManagerModule.bsl
// Мастер «Новое AI-действие»: из ответов администратора собирает карту
// извлечения, сценарий и место запуска. Вручную это четыре справочника,
// которые заполняются в строгом порядке и связываются друг с другом, и
// ошибка в любом звене всплывает только у пользователя.
//
// Логика лежит в модуле менеджера, а не в форме: так ее проверяют
// функциональные тесты, и то же действие можно завести программно.

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Описание нового действия со значениями по умолчанию.
//
// Возвращает структуру:
//   ПолноеИмяМетаданных - Строка - объект действия: где показывать команду и
//                         на какие реквизиты настроена карта; для «Создать
//                         объект» — вид создаваемого объекта;
//   ТипМеста            - Строка - "Объект" (в карточке) или "Глобально"
//                         (в помощнике раздела LLM, без объекта);
//   Наименование        - Строка - подпись команды; так же называются новые карта и сценарий;
//   ИсточникДанных      - Строка - что модель получает: "Файл", "Данные" (данные
//                         самого объекта) или "Нет";
//   ДанныеОбъекта       - Массив из Структура - ТабличнаяЧасть, ПутьРеквизита:
//                         что из объекта передать модели при источнике "Данные";
//   РежимДиалога        - Булево - сначала разговор, результат — по кнопке;
//   ВидДействия         - ПеречислениеСсылка.AI_ВидДействия;
//   ОтветТекстом        - Булево - ответ модели показывается текстом, карты нет;
//   Поля                - Массив из Структура - отмеченные реквизиты, колонки как у
//                         AI_ИзвлечениеРеквизитов.КандидатыПолейКарты плюс Обязательное;
//   КартаИзвлечения     - СправочникСсылка.AI_КартыИзвлечения - готовая карта вместо Поля;
//   РежимСтрок          - Строка - строки табличных частей: "Добавлять",
//                         "Заменять" или "Обновлять" (существующие, по номеру);
//   РазрешитьПачку      - Булево - запуск по нескольким объектам списка через очередь;
//   ОбразецСценария     - СправочникСсылка.AI_Сценарии - откуда взять агента и модель;
//   НачальныйЗапрос     - Строка - что сказать модели;
//   Включить            - Булево - сразу показать действие пользователям;
//   ПодключитьКоманду   - Булево - назначить обработку помощника БСП на объект.
Функция НовоеОписание() Экспорт

	Описание = Новый Структура;
	Описание.Вставить("ПолноеИмяМетаданных", "");
	Описание.Вставить("ТипМеста", "Объект");
	Описание.Вставить("Наименование", "");
	Описание.Вставить("ИсточникДанных", "Файл");
	Описание.Вставить("ДанныеОбъекта", Новый Массив);
	Описание.Вставить("РежимДиалога", Ложь);
	Описание.Вставить("ВидДействия", Перечисления.AI_ВидДействия.ЗаполнитьФорму);
	Описание.Вставить("ОтветТекстом", Ложь);
	Описание.Вставить("Поля", Новый Массив);
	Описание.Вставить("КартаИзвлечения", Справочники.AI_КартыИзвлечения.ПустаяСсылка());
	Описание.Вставить("РежимСтрок", "Добавлять");
	Описание.Вставить("РазрешитьПачку", Ложь);
	Описание.Вставить("ОбразецСценария", ОбразецПоУмолчанию());
	Описание.Вставить("НачальныйЗапрос", "");
	Описание.Вставить("Включить", Истина);
	Описание.Вставить("ПодключитьКоманду", Ложь);
	Возврат Описание;

КонецФункции

// Что мешает создать действие и на что стоит обратить внимание.
//
// Возвращает структуру:
//   Ошибки         - Массив из Строка - без их исправления создавать нельзя;
//   Предупреждения - Массив из Строка - создать можно, но результат удивит.
Функция ПроверитьОписание(Описание) Экспорт

	Ошибки = Новый Массив;
	Предупреждения = Новый Массив;
	Виды = Перечисления.AI_ВидДействия;

	Если Не ПравоДоступа("Добавление", Метаданные.Справочники.AI_МестаЗапускаСценариев)
		Или Не ПравоДоступа("Добавление", Метаданные.Справочники.AI_КартыИзвлечения)
		Или Не ПравоДоступа("Добавление", Метаданные.Справочники.AI_Сценарии) Тогда
		Ошибки.Добавить("Нет права создавать сценарии, карты и места запуска:"
			+ " мастер доступен администратору подсистемы LLM.");
	КонецЕсли;

	Имя = СокрЛП(Описание.ПолноеИмяМетаданных);
	ОписаниеОбъекта = Неопределено;
	Если Не ЗначениеЗаполнено(Имя) Тогда
		Ошибки.Добавить("Выберите объект, с которым работает действие.");
	Иначе
		ОписаниеОбъекта = Метаданные.НайтиПоПолномуИмени(Имя);
		Если ОписаниеОбъекта = Неопределено Тогда
			Ошибки.Добавить(СтрШаблон("Объект «%1» не найден в конфигурации.", Имя));
		КонецЕсли;
	КонецЕсли;

	Глобально = (Описание.ТипМеста = "Глобально");
	Наименование = СокрЛП(Описание.Наименование);
	Если Не ЗначениеЗаполнено(Наименование) Тогда
		Ошибки.Добавить("Введите название действия — так будет подписана команда у пользователя.");
	ИначеЕсли ЗначениеЗаполнено(Имя) Тогда
		Для Каждого Действие Из ДействияОбъекта(Имя, Описание.ТипМеста) Цикл
			Если НРег(Действие.ПредставлениеКоманды) = НРег(Наименование) Тогда
				Предупреждения.Добавить(СтрШаблон("Действие «%1» уже есть —"
					+ " пользователь увидит две одинаковые команды.", Действие.ПредставлениеКоманды));
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	// Без объекта нет ни его файла, ни его данных, а заполнять и записывать нечего.
	Если Глобально Тогда
		Если Описание.ИсточникДанных <> "Нет" Тогда
			Ошибки.Добавить("Без объекта у модели нет ни файла, ни данных объекта:"
				+ " выберите «Ничего, кроме того, что расскажет пользователь».");
		КонецЕсли;
		Если Описание.ВидДействия = Виды.ЗаполнитьФорму Или Описание.ВидДействия = Виды.ЗаписатьОбъект Тогда
			Ошибки.Добавить("Без объекта заполнять и записывать нечего: выберите «Создать новый объект»,"
				+ " «Только показать» или «Ответ текстом».");
		КонецЕсли;
		Если Описание.РазрешитьПачку Тогда
			Ошибки.Добавить("Пачка запускается из списка объектов, а действие без объекта в списке не видно.");
		КонецЕсли;
	КонецЕсли;

	Если Описание.ИсточникДанных = "Файл" И ЗначениеЗаполнено(Имя) И ОписаниеОбъекта <> Неопределено
		И AI_ИзвлечениеРеквизитов.ШаблонУточненияФайлов(Имя) = Неопределено Тогда
		Ошибки.Добавить("Не удалось распознать, как конфигурация хранит файлы этого объекта."
			+ " Выберите другой источник — вопрос о файле можно настроить потом в месте запуска.");
	КонецЕсли;
	Если Описание.ИсточникДанных = "Данные" И Описание.ДанныеОбъекта.Количество() = 0 Тогда
		Ошибки.Добавить("Отметьте, какие данные объекта передать модели.");
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Описание.ВидДействия) Тогда
		Ошибки.Добавить("Выберите, что делать с ответом модели.");
	КонецЕсли;

	Карта = Описание.КартаИзвлечения;
	Если Не Описание.ОтветТекстом Тогда
		Если ЗначениеЗаполнено(Карта) Тогда
			Если Карта.ПометкаУдаления Или Не Карта.Активна Тогда
				Ошибки.Добавить(СтрШаблон("Карта «%1» выключена — выберите другую или отметьте реквизиты.", Карта));
			ИначеЕсли ЗначениеЗаполнено(Карта.ПолноеИмяМетаданных) И Карта.ПолноеИмяМетаданных <> "*"
				И СокрЛП(Карта.ПолноеИмяМетаданных) <> Имя Тогда
				Предупреждения.Добавить(СтрШаблон("Карта «%1» настроена на другой объект —"
					+ " ее реквизиты у этого объекта могут не найтись.", Карта));
			КонецЕсли;
		ИначеЕсли Описание.Поля.Количество() = 0 Тогда
			Ошибки.Добавить("Отметьте хотя бы одно поле, которое должна вернуть модель.");
		КонецЕсли;
	КонецЕсли;

	Если Описание.ВидДействия = Виды.СоздатьОбъект И ОписаниеОбъекта <> Неопределено Тогда
		ЭтоСправочник = Метаданные.Справочники.Содержит(ОписаниеОбъекта);
		Если Не ЭтоСправочник И Не Метаданные.Документы.Содержит(ОписаниеОбъекта) Тогда
			Ошибки.Добавить("Создавать можно только элементы справочников и документы.");
		ИначеЕсли ЭтоСправочник И Не ЗначениеЗаполнено(Карта) И Не ЕстьПоле(Описание.Поля, "Наименование") Тогда
			Предупреждения.Добавить("Наименование не отмечено — новый элемент без него может не записаться.");
		КонецЕсли;
	КонецЕсли;

	Если Описание.РежимСтрок = "Обновлять" И ЕстьПолеТабличнойЧасти(Описание.Поля)
		И Описание.ИсточникДанных <> "Данные" Тогда
		Ошибки.Добавить("Обновлять строки по номеру можно, только если модель видит эти строки:"
			+ " выберите «Данные самого объекта».");
	КонецЕсли;

	Если Описание.РежимДиалога И Описание.РазрешитьПачку Тогда
		Ошибки.Добавить("Разговор ведется по одному объекту: пачку с диалогом не совместить.");
	ИначеЕсли Описание.РазрешитьПачку И Описание.ВидДействия = Виды.ЗаполнитьФорму Тогда
		Предупреждения.Добавить(AI_ИнтерфейсныеСценарии.ТекстПачкаБезФормы());
	КонецЕсли;

	Если НуженНовыйСценарий(Описание) Тогда
		Образец = Описание.ОбразецСценария;
		Если Не ЗначениеЗаполнено(Образец) Тогда
			Ошибки.Добавить("Выберите сценарий-образец: из него возьмутся агент и модель.");
		ИначеЕсли Образец.ПометкаУдаления Тогда
			Ошибки.Добавить(СтрШаблон("Сценарий «%1» помечен на удаление — выберите другой образец.", Образец));
		ИначеЕсли Не ЗначениеЗаполнено(Образец.Агент) Или Не ЗначениеЗаполнено(Образец.Модель) Тогда
			Ошибки.Добавить(СтрШаблон("В сценарии «%1» не заполнены агент или модель —"
				+ " копировать нечего. Выберите другой образец.", Образец));
		КонецЕсли;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(СокрЛП(Описание.НачальныйЗапрос)) Тогда
		Ошибки.Добавить("Напишите, что сказать модели: без запроса она не знает, что делать.");
	КонецЕсли;

	Возврат Новый Структура("Ошибки,Предупреждения", Ошибки, Предупреждения);

КонецФункции

// Заводит действие: карту (если не выбрана готовая и ответ не текстом),
// сценарий по образцу (если у карты еще нет своего), переносит в сценарий
// схему ответа и создает место запуска. Все или ничего — в одной транзакции.
//
// Команда помощника подключается к объекту уже после: это запись в реестр
// БСП, и ее сбой не должен отменять созданные настройки.
//
// Возвращает структуру:
//   МестоЗапуска, КартаИзвлечения, Сценарий - ссылки на созданное или выбранное;
//   Создано   - Массив из Строка - что сделано, для человека;
//   Проблемы  - Массив из Строка - что еще мешает действию работать;
//   МожноНазначитьОбработку - Булево - команду помощника можно подключить к объекту.
Функция СоздатьДействие(Описание) Экспорт

	Проверка = ПроверитьОписание(Описание);
	Если Проверка.Ошибки.Количество() > 0 Тогда
		ВызватьИсключение СтрСоединить(Проверка.Ошибки, Символы.ПС);
	КонецЕсли;

	Результат = Новый Структура("МестоЗапуска,КартаИзвлечения,Сценарий,Создано,Проблемы,МожноНазначитьОбработку",
		Неопределено, Неопределено, Неопределено, Новый Массив, Новый Массив, Ложь);
	Имя = СокрЛП(Описание.ПолноеИмяМетаданных);
	Наименование = СокрЛП(Описание.Наименование);

	НачатьТранзакцию();
	Попытка
		Карта = Справочники.AI_КартыИзвлечения.ПустаяСсылка();
		Если Не Описание.ОтветТекстом Тогда
			Карта = Описание.КартаИзвлечения;
			Если Не ЗначениеЗаполнено(Карта) Тогда
				Карта = СоздатьКарту(Описание);
				Результат.Создано.Добавить(СтрШаблон("карта извлечения «%1», полей: %2",
					Карта, Описание.Поля.Количество()));
			КонецЕсли;
		КонецЕсли;

		Сценарий = СценарийКарты(Карта);
		Если ЗначениеЗаполнено(Сценарий) Тогда
			Результат.Создано.Добавить(СтрШаблон("сценарий «%1» взят тот же, что уже работает с картой", Сценарий));
		Иначе
			Сценарий = СоздатьСценарий(Описание.ОбразецСценария, Наименование);
			Результат.Создано.Добавить(СтрШаблон("сценарий «%1» (код %2) — агент и модель как в «%3»",
				Сценарий, Сценарий.Код, Описание.ОбразецСценария));
		КонецЕсли;
		// Операция берет схему ответа из сценария: без переноса модель не спросят
		// о полях карты.
		Если ЗначениеЗаполнено(Карта) Тогда
			AI_ИзвлечениеРеквизитов.ЗаписатьСхемуВСценарий(Карта, Сценарий);
		КонецЕсли;

		Место = СоздатьМесто(Описание, Карта, Сценарий);
		Результат.Создано.Добавить(СтрШаблон("место запуска «%1» %2%3%4",
			Место,
			?(Описание.ТипМеста = "Глобально",
				"в AI-помощнике раздела LLM",
				"в карточке «" + AI_ИнтерфейсныеСценарии.ПредставлениеОбъектаМетаданных(Имя) + "»"),
			?(Описание.РазрешитьПачку, " и для пачки из списка", ""),
			?(Описание.Включить, "", " — пока выключено")));

		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

	Результат.МестоЗапуска = Место;
	Результат.КартаИзвлечения = Карта;
	Результат.Сценарий = Сценарий;

	Если Описание.ПодключитьКоманду И Описание.ТипМеста <> "Глобально" Тогда
		Попытка
			AI_ИнтерфейсныеСценарии.НазначитьОбработкуБСП(Имя);
			Результат.Создано.Добавить("команда помощника подключена к объекту");
		Исключение
			Результат.Проблемы.Добавить("Не удалось подключить команду помощника: "
				+ КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЕсли;

	Состояние = AI_ИнтерфейсныеСценарии.ПроблемыНастройкиМеста(Место);
	Для Каждого Проблема Из Состояние.Проблемы Цикл
		Результат.Проблемы.Добавить(Проблема);
	КонецЦикла;
	Результат.МожноНазначитьОбработку = Состояние.МожноНазначитьОбработку;

	ЗаписьЖурналаРегистрации(
		"AI.НастройкаДействий",
		УровеньЖурналаРегистрации.Информация,
		Метаданные.Справочники.AI_МестаЗапускаСценариев,
		Место,
		"Мастер «Новое AI-действие» создал: " + СтрСоединить(Результат.Создано, "; "));

	Возврат Результат;

КонецФункции

// Действия, уже настроенные для объекта (или без объекта): мастеру нужно их
// показать, чтобы администратор не завел второе такое же.
//
// Возвращает массив структур: Ссылка, ПредставлениеКоманды, ВидДействия, Пачка, Активно.
Функция ДействияОбъекта(ПолноеИмя, ТипМеста = "Объект") Экспорт

	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Места.Ссылка КАК Ссылка,
		|	ВЫБОР
		|		КОГДА Места.ПредставлениеКоманды = """"
		|			ТОГДА Места.Наименование
		|		ИНАЧЕ Места.ПредставлениеКоманды
		|	КОНЕЦ КАК ПредставлениеКоманды,
		|	Места.ВидДействия КАК ВидДействия,
		|	Места.РазрешитьНесколькоОбъектов КАК Пачка,
		|	Места.Активно КАК Активно
		|ИЗ
		|	Справочник.AI_МестаЗапускаСценариев КАК Места
		|ГДЕ
		|	НЕ Места.ПометкаУдаления
		|	И Места.ТипМеста = &ТипМеста
		|	И (&ТипМеста = ""Глобально"" ИЛИ Места.ПолноеИмяМетаданных = &ПолноеИмя)
		|УПОРЯДОЧИТЬ ПО
		|	Места.Порядок,
		|	Места.Наименование");
	Запрос.УстановитьПараметр("ПолноеИмя", СокрЛП(ПолноеИмя));
	Запрос.УстановитьПараметр("ТипМеста", ?(ТипМеста = "Глобально", "Глобально", "Объект"));
	Результат = Новый Массив;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Действие = Новый Структура("Ссылка,ПредставлениеКоманды,ВидДействия,Пачка,Активно");
		ЗаполнитьЗначенияСвойств(Действие, Выборка);
		Результат.Добавить(Действие);
	КонецЦикла;
	Возврат Результат;

КонецФункции

// Сценарий, с которым карта уже работает. Схема ответа у сценария одна, поэтому
// для новой карты нужен свой сценарий, а для готовой — тот же, что у нее был.
Функция СценарийКарты(Карта) Экспорт

	Если Не ЗначениеЗаполнено(Карта) Тогда
		Возврат Справочники.AI_Сценарии.ПустаяСсылка();
	КонецЕсли;
	Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Места.Сценарий КАК Сценарий,
		|	КОЛИЧЕСТВО(*) КАК Мест
		|ИЗ
		|	Справочник.AI_МестаЗапускаСценариев КАК Места
		|ГДЕ
		|	Места.КартаИзвлечения = &Карта
		|	И НЕ Места.ПометкаУдаления
		|	И НЕ Места.Сценарий.ПометкаУдаления
		|	И Места.Сценарий <> ЗНАЧЕНИЕ(Справочник.AI_Сценарии.ПустаяСсылка)
		|СГРУППИРОВАТЬ ПО
		|	Места.Сценарий
		|УПОРЯДОЧИТЬ ПО
		|	Мест УБЫВ");
	Запрос.УстановитьПараметр("Карта", Карта);
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат ?(Выборка.Следующий(), Выборка.Сценарий, Справочники.AI_Сценарии.ПустаяСсылка());

КонецФункции

// Запрос к модели по умолчанию — под то, откуда модель берет данные и что
// должна вернуть. Пустое значение она должна вернуть явно, иначе строгая
// схема заставит ее что-нибудь выдумать.
Функция ТекстЗапросаПоУмолчанию(ПолноеИмя, ИсточникДанных = "Файл", РежимДиалога = Ложь,
	ВидРезультата = "") Экспорт

	ОписаниеОбъекта = Метаданные.НайтиПоПолномуИмени(СокрЛП(ПолноеИмя));
	Объект = ?(ОписаниеОбъекта = Неопределено, "объекта", "«" + ОписаниеОбъекта.Синоним + "»");
	Если РежимДиалога Тогда
		// В разговоре речь об одном объекте: модель, прочитав «данные для
		// «Шаблоны согласования»», так и говорила пользователю — во множественном.
		Один = ?(ОписаниеОбъекта = Неопределено, "",
			"«" + AI_ИнтерфейсныеСценарии.ПредставлениеОдногоОбъекта(ОписаниеОбъекта) + "»");
		Если ВидРезультата = "СоздатьОбъект" Тогда
			Возврат СтрШаблон("Помоги пользователю собрать новый объект %1: выясни значения нужных полей,"
				+ " уточни неясное и предложи итог. По итогам разговора объект будет создан в базе.", Один);
		КонецЕсли;
		Возврат СтрШаблон("Помоги пользователю собрать данные для объекта %1: выясни значения нужных полей,"
			+ " уточни неясное и предложи итог.", Один);
	КонецЕсли;
	Если ВидРезультата = "Текст" Тогда
		Возврат СтрШаблон("Проверь данные %1: найди ошибки, пропуски и противоречия и кратко перечисли их."
			+ " Если замечаний нет, так и скажи.", Объект);
	КонецЕсли;
	Если ИсточникДанных = "Файл" Тогда
		Возврат СтрШаблон("Извлеки из приложенного файла реквизиты %1 и верни их строго по схеме ответа."
			+ " Если значения в документе нет, верни пустую строку или ноль.", Объект);
	КонецЕсли;
	Возврат СтрШаблон("Определи по данным %1 значения полей и верни их строго по схеме ответа."
		+ " Если значение определить нельзя, верни пустую строку или ноль.", Объект);

КонецФункции

// Откуда помощник возьмет файл объекта — фраза для администратора. Пустая
// строка, если схема хранения файлов не распознана.
Функция ПредставлениеХраненияФайлов(ПолноеИмя) Экспорт

	Шаблон = AI_ИзвлечениеРеквизитов.ШаблонУточненияФайлов(ПолноеИмя);
	Если Шаблон = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	Источник = Метаданные.НайтиПоПолномуИмени(Шаблон.ИсточникДанных);
	Возврат СтрШаблон("Пользователь выберет один из файлов объекта («%1»): %2."
		+ " В пачке файл выбирается сам — первый подходящий.",
		?(Источник = Неопределено, Шаблон.ИсточникДанных, Источник.Синоним),
		Шаблон.ОтборЗначение);

КонецФункции

// Нужен ли новый сценарий: у готовой карты он свой, а для новой карты и для
// ответа текстом — копия образца со своей схемой.
Функция НуженНовыйСценарий(Описание) Экспорт

	Возврат Описание.ОтветТекстом Или Не ЗначениеЗаполнено(СценарийКарты(Описание.КартаИзвлечения));

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Образец по умолчанию — сценарий, на котором уже работает больше всего мест:
// он заведомо настроен и проверен. Нужен и мастеру, и загрузке пакета, которой
// агента и модель взять больше неоткуда.
Функция ОбразецПоУмолчанию() Экспорт

	Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Сценарии.Ссылка КАК Ссылка,
		|	КОЛИЧЕСТВО(Места.Ссылка) КАК Мест
		|ИЗ
		|	Справочник.AI_Сценарии КАК Сценарии
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.AI_МестаЗапускаСценариев КАК Места
		|		ПО (Места.Сценарий = Сценарии.Ссылка)
		|			И (НЕ Места.ПометкаУдаления)
		|ГДЕ
		|	НЕ Сценарии.ПометкаУдаления
		|	И Сценарии.Активен
		|	И Сценарии.Агент <> ЗНАЧЕНИЕ(Справочник.AI_Агенты.ПустаяСсылка)
		|	И Сценарии.Модель <> ЗНАЧЕНИЕ(Справочник.AI_Модели.ПустаяСсылка)
		|СГРУППИРОВАТЬ ПО
		|	Сценарии.Ссылка
		|УПОРЯДОЧИТЬ ПО
		|	Мест УБЫВ");
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат ?(Выборка.Следующий(), Выборка.Ссылка, Справочники.AI_Сценарии.ПустаяСсылка());

КонецФункции

Функция СоздатьКарту(Описание)

	Карта = Справочники.AI_КартыИзвлечения.СоздатьЭлемент();
	Карта.Наименование = СокрЛП(Описание.Наименование);
	Карта.Активна = Истина;
	Карта.ПолноеИмяМетаданных = СокрЛП(Описание.ПолноеИмяМетаданных);
	Карта.Описание = "Создана мастером «Новое AI-действие».";
	Карта.ЗаменятьСтрокиТабличныхЧастей = (Описание.РежимСтрок = "Заменять");
	Карта.ОбновлятьСтрокиПоНомеру = (Описание.РежимСтрок = "Обновлять");
	Для Каждого Поле Из Описание.Поля Цикл
		// Ключ в ответе карта выведет сама при записи.
		СтрокаКарты = Карта.Поля.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаКарты, Поле,
			"Представление,ПутьРеквизита,ДополнительныйРеквизит,ТипЗначения,ТипСсылки,"
				+ "ПоискПоНаименованию,Подсказка,Обязательное");
		Если Поле.Свойство("ТабличнаяЧасть") Тогда
			СтрокаКарты.ТабличнаяЧасть = Поле.ТабличнаяЧасть;
		КонецЕсли;
		Если Поле.Свойство("ВыбиратьИзСписка") Тогда
			СтрокаКарты.ВыбиратьИзСписка = Поле.ВыбиратьИзСписка;
		КонецЕсли;
		// «Сторона: Подписал» — для модели лишнее: табличная часть и так видна
		// по структуре ответа.
		Если ЗначениеЗаполнено(СтрокаКарты.ТабличнаяЧасть) И СтрНайти(СтрокаКарты.Представление, ": ") > 0 Тогда
			СтрокаКарты.Представление = Сред(СтрокаКарты.Представление, СтрНайти(СтрокаКарты.Представление, ": ") + 2);
		КонецЕсли;
	КонецЦикла;
	Карта.Записать();
	Возврат Карта.Ссылка;

КонецФункции

// Копия образца: агент, провайдер, модель, способ разбора вложений и попытки
// те же, схема ответа — своя. Сценарий включен сразу: сам по себе он нигде не
// виден, видимостью действия управляет место запуска.
Функция СоздатьСценарий(Образец, Наименование) Экспорт

	Сценарий = Образец.ПолучитьОбъект().Скопировать();
	Сценарий.Код = НовыйКодСценария();
	Сценарий.Наименование = Наименование;
	Сценарий.Активен = Истина;
	Сценарий.СхемаОтветаJSON = "";
	// Старая очередь обслуживается одним сценарием, копия его не наследует.
	Сценарий.ИспользоватьДляСтаройОчереди = Ложь;
	Сценарий.Записать();
	Возврат Сценарий.Ссылка;

КонецФункции

Функция СоздатьМесто(Описание, Карта, Сценарий)

	Имя = СокрЛП(Описание.ПолноеИмяМетаданных);
	Глобально = (Описание.ТипМеста = "Глобально");
	Место = Справочники.AI_МестаЗапускаСценариев.СоздатьЭлемент();
	// Наименование совпадает с подписью команды: обращение «не работает кнопка X»
	// тогда находится в списке мест без открытия каждой карточки.
	Место.Наименование = СокрЛП(Описание.Наименование);
	Место.ПредставлениеКоманды = Место.Наименование;
	Место.Активно = Описание.Включить;
	Место.Сценарий = Сценарий;
	Место.КартаИзвлечения = Карта;
	Место.ТипМеста = ?(Глобально, "Глобально", "Объект");
	Место.ПолноеИмяМетаданных = ?(Глобально, "", Имя);
	Место.ВидДействия = ?(Описание.ОтветТекстом, Перечисления.AI_ВидДействия.ТолькоПоказать, Описание.ВидДействия);
	Место.РежимДиалога = Описание.РежимДиалога;
	Место.РазрешитьНесколькоОбъектов = Описание.РазрешитьПачку;
	Если Описание.РазрешитьПачку Тогда
		Место.РежимВыполнения = Перечисления.AI_РежимВыполнения.Очередь;
	КонецЕсли;
	Место.НачальныйЗапрос = СокрЛП(Описание.НачальныйЗапрос);
	Место.Порядок = СледующийПорядок(?(Глобально, "", Имя));

	Если Описание.ИсточникДанных = "Файл" И Не Глобально Тогда
		ЗаполнитьЗначенияСвойств(Место.Уточнения.Добавить(),
			AI_ИзвлечениеРеквизитов.ШаблонУточненияФайлов(Имя));
	КонецЕсли;
	Если Описание.ИсточникДанных = "Данные" И Не Глобально Тогда
		Для Каждого СтрокаДанных Из Описание.ДанныеОбъекта Цикл
			ЗаполнитьЗначенияСвойств(Место.ДанныеОбъекта.Добавить(), СтрокаДанных);
		КонецЦикла;
		// Номер строки модель берет из данных: табличная часть, которую
		// обновляют по номеру, должна в них быть.
		Если Описание.РежимСтрок = "Обновлять" Тогда
			Для Каждого Поле Из Описание.Поля Цикл
				Если Поле.Свойство("ТабличнаяЧасть") И ЗначениеЗаполнено(Поле.ТабличнаяЧасть)
					И Место.ДанныеОбъекта.Найти(Поле.ТабличнаяЧасть, "ТабличнаяЧасть") = Неопределено Тогда
					СтрокаДанных = Место.ДанныеОбъекта.Добавить();
					СтрокаДанных.ТабличнаяЧасть = Поле.ТабличнаяЧасть;
					СтрокаДанных.ПутьРеквизита = "*";
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;

	Место.Описание = ОписаниеДляПользователя(Описание, Карта);
	Место.Записать();
	Возврат Место.Ссылка;

КонецФункции

// Пояснение под командой у пользователя: что прочитает и что сделает.
Функция ОписаниеДляПользователя(Описание, Карта)

	Названия = Новый Массив;
	Если ЗначениеЗаполнено(Карта) Тогда
		Для Каждого Поле Из Карта.Поля Цикл
			Название = СокрЛП(Поле.Представление);
			Если ЗначениеЗаполнено(Название) И Названия.Найти(Название) = Неопределено Тогда
				Названия.Добавить(Название);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Показать = 4;
	Перечень = Новый Массив;
	Для Индекс = 0 По Мин(Показать, Названия.Количество()) - 1 Цикл
		Перечень.Добавить(Названия[Индекс]);
	КонецЦикла;
	Поля = СтрСоединить(Перечень, ", ");
	Если Названия.Количество() > Показать Тогда
		Поля = СтрШаблон("%1 и еще %2", Поля, Названия.Количество() - Показать);
	КонецЕсли;

	ОписаниеОбъекта = Метаданные.НайтиПоПолномуИмени(СокрЛП(Описание.ПолноеИмяМетаданных));
	Объект = ?(ОписаниеОбъекта = Неопределено, "объект",
		AI_ИнтерфейсныеСценарии.ПредставлениеОдногоОбъекта(ОписаниеОбъекта));
	Если Описание.РежимДиалога И Описание.ВидДействия = Перечисления.AI_ВидДействия.СоздатьОбъект Тогда
		Возврат СтрШаблон("В разговоре помогает собрать «%1» и создает его: %2.", Объект, Поля);
	ИначеЕсли Описание.РежимДиалога Тогда
		Возврат СтрШаблон("В разговоре уточняет, что нужно, и предлагает значения: %1.", Поля);
	ИначеЕсли Описание.ОтветТекстом Тогда
		Возврат "Анализирует объект и отвечает текстом.";
	ИначеЕсли Описание.ИсточникДанных = "Файл" Тогда
		Возврат СтрШаблон("Читает файл объекта — текст, PDF или скан — и предлагает значения реквизитов: %1.", Поля);
	ИначеЕсли Описание.ИсточникДанных = "Данные" Тогда
		Возврат СтрШаблон("По данным объекта предлагает значения: %1.", Поля);
	КонецЕсли;
	Возврат СтрШаблон("Предлагает значения: %1.", Поля);

КонецФункции

Функция ЕстьПоле(Поля, ПутьРеквизита)

	Для Каждого Поле Из Поля Цикл
		Если Поле.ПутьРеквизита = ПутьРеквизита
			И Не (Поле.Свойство("ТабличнаяЧасть") И ЗначениеЗаполнено(Поле.ТабличнаяЧасть)) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат Ложь;

КонецФункции

Функция ЕстьПолеТабличнойЧасти(Поля)

	Для Каждого Поле Из Поля Цикл
		Если Поле.Свойство("ТабличнаяЧасть") И ЗначениеЗаполнено(Поле.ТабличнаяЧасть) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат Ложь;

КонецФункции

// Новое действие встает после уже настроенных для того же объекта.
Функция СледующийПорядок(ПолноеИмя)

	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ЕСТЬNULL(МАКСИМУМ(Места.Порядок), 0) КАК Порядок
		|ИЗ
		|	Справочник.AI_МестаЗапускаСценариев КАК Места
		|ГДЕ
		|	НЕ Места.ПометкаУдаления
		|	И Места.ПолноеИмяМетаданных = &ПолноеИмя");
	Запрос.УстановитьПараметр("ПолноеИмя", ПолноеИмя);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Порядок + 10;

КонецФункции

// Код сценария — его стабильный идентификатор в журналах и программном
// интерфейсе. Для созданных мастером — ACT и номер по порядку.
Функция НовыйКодСценария()

	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Сценарии.Код КАК Код
		|ИЗ
		|	Справочник.AI_Сценарии КАК Сценарии
		|ГДЕ
		|	Сценарии.Код ПОДОБНО ""ACT%""");
	Номер = 0;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Хвост = Сред(СокрЛП(Выборка.Код), 4);
		Если СтрДлина(Хвост) > 0 И ТолькоЦифры(Хвост) Тогда
			Номер = Макс(Номер, Число(Хвост));
		КонецЕсли;
	КонецЦикла;
	Возврат "ACT" + Формат(Номер + 1, "ЧЦ=5; ЧВН=; ЧГ=0");

КонецФункции

Функция ТолькоЦифры(Текст)

	Для Позиция = 1 По СтрДлина(Текст) Цикл
		Если СтрНайти("0123456789", Сред(Текст, Позиция, 1)) = 0 Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	Возврат Истина;

КонецФункции

#КонецОбласти

#КонецЕсли
